<?php
/* @var $this yii\web\View */
$this->title = 'Главная страница';
?>
<!-- Banner -->
<section id="banner">
    <div class="content">
        <header>
            <h1>Виконання практики</h1>
        </header>
        <p>Тестове 20.06.2018
        <p>    LEVEL - trainee junior.
        <p> Блог.
        <p> 1. Шаблон basic.
        <p> 2. У блогу має бути адміністративна і клієнтська частина з Особистим кабінетом
         (реалізувати окремими модулями, структуру каталогів з моделями,
         контролерами зробити відповідно модулям).
        <p> 3. Створювати статті може як адміністратор, так і зареєстрований користувач.
        <p> 4. Публікує на клієнтській частині тільки адміністратор.
        <p> 5. У блогу мають бути категорії і відповідно їм статті.
        <p> 6. Категорії створюються окремо.
        <p> 7. Набір полів для статті довільний (обов’язково має бути: назва, лого, опис(з
         підключеним ckeditor - з можливістю завантаження тільки картинок)).
        <p> 8. Також в адміністративні частині має бути управління користувачами, з
         можливістю заблокувати користувача.
        <p> 9. Адміністратору доступні всі статті користувачів. Користувачам - тільки власні, з
         фільтром - опублікованні і на модерації.
        <p> 10. Згенерувати рандомних 5 користувачів.
        <p> 11. Для прикладу згенерувати 50 категорій і 200 статей для цих користувачів і для
         адміна.
        <p> 12. На клієнтській частині урли мають бути ЧПУ, типу - 'category'/'article'.
    </div>
</section>


